turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8B.atdf
        <register name="IER" offset="0x28" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Enable" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Enable" mask="0x4"/>
        </register>
        <register name="IDR" offset="0x2C" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Disable" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Disable" mask="0x4"/>
        </register>
        <register name="IMR" offset="0x30" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="SAMPLE" caption="Sample Ready Interrupt Mask" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch Interrupt Mask" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch Interrupt Mask" mask="0x4"/>
        </register>
        <register name="SCR" offset="0x34" rw="W" size="4" access-size="4" atomic-op="clear:ISR" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="SAMPLE" caption="Sample Ready" mask="0x1"/>
          <bitfield name="INTCH" caption="In-touch" mask="0x2"/>
          <bitfield name="OUTTCH" caption="Out-of-Touch" mask="0x4"/>
        </register>
        <register name="INTCH" offset="0x40" rw="R" size="4" access-size="4" count="1" initval="0x00000000" caption="In-Touch Status Register">
          <bitfield name="INTCH" caption="In-Touch" mask="0xFFFFFFFF"/>
        </register>
        <register name="INTCHCLR" offset="0x50" rw="W" size="4" access-size="4" atomic-op="clear:INTCH" count="1" initval="0x00000000" caption="In-Touch Status Clear Register">
          <bitfield name="INTCHCLR" caption="In-Touch Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTCH" offset="0x60" rw="R" size="4" access-size="4" count="1" initval="0x00000000" caption="Out-of-Touch Status Register">
          <bitfield name="OUTTCH" caption="Out-of-Touch" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTCHCLR" offset="0x70" rw="W" size="4" access-size="4" atomic-op="clear:OUTTCH" count="1" initval="0x00000000" caption="Out-of-Touch Status Clear Register">
          <bitfield name="OUTTCHCLR" caption="Out of Touch" mask="0xFFFFFFFF"/>
        </register>
        <register name="PARAMETER" offset="0xF8" rw="R" size="4" access-size="4" caption="Parameter Register">
          <bitfield name="NPINS" caption="Number of Pins" mask="0xFF"/>
          <bitfield name="NSTATUS" caption="Number of Status bits" mask="0xFF00"/>
          <bitfield name="FRACTIONAL" caption="Number of Fractional bits" mask="0xF0000"/>
        </register>
        <register name="VERSION" offset="0xFC" rw="R" size="4" access-size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="CHIPID" version="1.0.0" caption="Chip ID Registers">
      <register-group name="CHIPID" caption="Chip ID Registers">
        <register name="CIDR" offset="0x340" rw="R" size="4" access-size="4" initval="0xAB0B0AE0" caption="Chip ID Register">
        </register>
        <register name="EXID" offset="0x344" rw="R" size="4" access-size="4" initval="0x1300000F" caption="Chip ID Extension Register">
        </register>
      </register-group>
    </module>
    <module name="CRCCU" id="I7644" version="2.0.2" caption="CRC Calculation Unit">
      <register-group name="CRCCU" caption="CRC Calculation Unit">
        <register name="DSCR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Descriptor Base Register">
          <bitfield name="DSCR" caption="Description Base Address" mask="0xFFFFFE00"/>
        </register>
        <register name="DMAEN" offset="0x8" rw="W" size="4" access-size="4" atomic-op="set:DMASR" initval="0x00000000" caption="DMA Enable Register">
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x1"/>
        </register>
        <register name="DMADIS" offset="0xC" rw="W" size="4" access-size="4" atomic-op="clear:DMASR" initval="0x00000000" caption="DMA Disable Register">
          <bitfield name="DMADIS" caption="DMA Disable" mask="0x1"/>
        </register>
        <register name="DMASR" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="DMA Status Register">
          <bitfield name="DMASR" caption="DMA Channel Status" mask="0x1"/>
        </register>
        <register name="DMAIER" offset="0x14" rw="W" size="4" access-size="4" atomic-op="set:DMAIMR" initval="0x00000000" caption="DMA Interrupt Enable Register">
          <bitfield name="DMAIER" caption="DMA Interrupt Enable" mask="0x1"/>
        </register>
        <register name="DMAIDR" offset="0x18" rw="W" size="4" access-size="4" atomic-op="clear:DMAIMR" initval="0x00000000" caption="DMA Interrupt Disable Register">
          <bitfield name="DMAIDR" caption="DMA Interrupt Disable" mask="0x1"/>
        </register>
        <register name="DMAIMR" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="DMA Interrupt Mask Register">
          <bitfield name="DMAIMR" caption="DMA Interrupt Mask" mask="0x1"/>
        </register>
        <register name="DMAISR" offset="0x20" rw="R" size="4" access-size="4" initval="0x00000000" caption="DMA Interrupt Status Register">
          <bitfield name="DMAISR" caption="DMA Interrupt Status" mask="0x1"/>
        </register>
        <register name="CR" offset="0x34" rw="W" size="4" access-size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="RESET" caption="Reset CRCComputation" mask="0x1"/>
        </register>
