turbq/atprog/packs/atmel/SAM4L_DFP/1.1.61/sam4l8/atdf/ATSAM4LC8B.atdf
                <register offset="0x00000360" size="1" name="NVICIP96" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI96" caption="Priority of interrupt 96"/>
                </register>
                <register offset="0x00000361" size="1" name="NVICIP97" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI97" caption="Priority of interrupt 97"/>
                </register>
                <register offset="0x00000362" size="1" name="NVICIP98" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI98" caption="Priority of interrupt 98"/>
                </register>
                <register offset="0x00000363" size="1" name="NVICIP99" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI99" caption="Priority of interrupt 99"/>
                </register>
                <register offset="0x00000364" size="1" name="NVICIP100" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI100" caption="Priority of interrupt 100"/>
                </register>
                <register offset="0x00000365" size="1" name="NVICIP101" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI101" caption="Priority of interrupt 101"/>
                </register>
                <register offset="0x00000366" size="1" name="NVICIP102" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI102" caption="Priority of interrupt 102"/>
                </register>
                <register offset="0x00000367" size="1" name="NVICIP103" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI103" caption="Priority of interrupt 103"/>
                </register>
                <register offset="0x00000368" size="1" name="NVICIP104" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI104" caption="Priority of interrupt 104"/>
                </register>
                <register offset="0x00000369" size="1" name="NVICIP105" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI105" caption="Priority of interrupt 105"/>
                </register>
                <register offset="0x00000e00" size="4" name="NVICSTIR" initval="0" caption="Software Trigger Interrupt Register">
                    <bitfield mask="0x000001ff" name="INTID" caption="Interrupt ID of the interrupt to trigger, in the range 0-239. For example, a value of 0x03 specifies interrupt IRQ3."/>
                </register>
            </register-group>
        </module><module name="MPU" caption="Memory Protection Unit Registers">
            <register-group name="MPU" caption="Memory Protection Unit">
                <register offset="0x00000000" size="4" name="MPU_TYPE" initval="0x00000800" caption="MPU Type Register" rw="R">
                    <bitfield mask="0x00000001" name="SEPARATE" caption="Indicates support for unified or separate instruction and date memory maps."/>
                    <bitfield mask="0x0000FF00" name="DREGION" caption="Indicates the number of supported MPU instruction regions."/>
                    <bitfield mask="0x00FF0000" name="IREGION" caption="Indicates the number of supported MPU data regions."/>
                </register>
                <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
                    <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
                    <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
                </register>
                <register offset="0x00000008" size="4" name="MPU_RNR" initval="0x00000000" caption="MPU Region Number Register" rw="RW">
                    <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
                </register>
                <register offset="0x0000000C" size="4" name="MPU_RBAR" initval="0x00000000" caption="MPU Region Base Address Register" rw="RW">
                    <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
                    <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
                    <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
                </register>
                <register offset="0x00000010" size="4" name="MPU_RASR" initval="0x00000000" caption="MPU Region Attribute and Size Register" rw="RW">
                    <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
                    <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
                    <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
                    <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
                    <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
                    <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
                    <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
                    <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
                </register>
            </register-group>
        </module></modules>
  <pinouts>
    <pinout name="QFP64" caption="QFP64">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA"/>
      <pin position="4" pad="RESET_N"/>
      <pin position="5" pad="VDDCORE"/>
      <pin position="6" pad="GNDIN"/>
      <pin position="7" pad="VDDOUT"/>
      <pin position="8" pad="VDDIN"/>
      <pin position="9" pad="TCK"/>
      <pin position="10" pad="PA"/>
      <pin position="11" pad="PB"/>
      <pin position="12" pad="PB"/>
      <pin position="13" pad="PB02"/>
      <pin position="14" pad="PB03"/>
      <pin position="15" pad="PA04"/>
      <pin position="16" pad="PA05"/>
      <pin position="17" pad="XIN32"/>
      <pin position="18" pad="XOUT32"/>
      <pin position="19" pad="PB04"/>
      <pin position="20" pad="PB05"/>
      <pin position="21" pad="PA"/>
      <pin position="22" pad="PA07"/>
      <pin position="23" pad="GNDANA"/>
      <pin position="24" pad="ADVREFP"/>
      <pin position="25" pad="VANA"/>
      <pin position="26" pad="PA08"/>
      <pin position="27" pad="PB06"/>
      <pin position="28" pad="PB07"/>
      <pin position="29" pad="PA09"/>
      <pin position="30" pad="PA10"/>
      <pin position="31" pad="PA11"/>
      <pin position="32" pad="PA12"/>
      <pin position="33" pad="CAPH"/>
      <pin position="34" pad="CAPL"/>
      <pin position="35" pad="VLCD"/>
      <pin position="36" pad="BIAS1"/>
      <pin position="37" pad="BIAS2"/>
      <pin position="38" pad="GNDIO00"/>
      <pin position="39" pad="VPUMP"/>
      <pin position="40" pad="PA"/>
      <pin position="41" pad="PA14"/>
      <pin position="42" pad="PA15"/>
      <pin position="43" pad="PA16"/>
      <pin position="44" pad="PA17"/>
      <pin position="45" pad="PB08"/>
      <pin position="46" pad="PB09"/>
      <pin position="47" pad="PB10"/>
      <pin position="48" pad="PB11"/>
      <pin position="49" pad="PA18"/>
      <pin position="50" pad="PA19"/>
      <pin position="51" pad="PA20"/>
      <pin position="52" pad="VDDIO"/>
      <pin position="53" pad="PB12"/>
      <pin position="54" pad="PB13"/>
      <pin position="55" pad="PA"/>
      <pin position="56" pad="PA"/>
      <pin position="57" pad="PB"/>
      <pin position="58" pad="PB"/>
      <pin position="59" pad="PA"/>
      <pin position="60" pad="PA"/>
      <pin position="61" pad="VDDIO04"/>
      <pin position="62" pad="PA25"/>
      <pin position="63" pad="PA26"/>
      <pin position="64" pad="GNDIO04"/>
    </pinout>
    <pinout name="WLCSP64" caption="WLCSP64">
      <pin position="A1" pad="PB04"/>
      <pin position="A2" pad="GNDANA"/>
      <pin position="A3" pad="ADVREFP"/>
      <pin position="A4" pad="VANA"/>
      <pin position="A5" pad="PA09"/>
      <pin position="A6" pad="CAPL"/>
      <pin position="A7" pad="CAPH"/>
      <pin position="A8" pad="PA12"/>
      <pin position="B1" pad="PB03"/>
      <pin position="B2" pad="XIN32"/>
      <pin position="B3" pad="XOUT32"/>
      <pin position="B4" pad="PA08"/>
      <pin position="B5" pad="PB06"/>
      <pin position="B6" pad="PA10"/>
      <pin position="B7" pad="PA11"/>
      <pin position="B8" pad="VLCD"/>
      <pin position="C1" pad="VDDIN"/>
      <pin position="C2" pad="PB"/>
      <pin position="C3" pad="PA05"/>
      <pin position="C4" pad="PA"/>
      <pin position="C5" pad="PA07"/>
      <pin position="C6" pad="PB07"/>
      <pin position="C7" pad="PA"/>
      <pin position="C8" pad="BIAS1"/>
      <pin position="D1" pad="VDDOUT"/>
      <pin position="D2" pad="PB"/>
      <pin position="D3" pad="PA04"/>
      <pin position="D4" pad="PB05"/>
      <pin position="D5" pad="PB12"/>
      <pin position="D6" pad="PB08"/>
      <pin position="D7" pad="PA14"/>
      <pin position="D8" pad="BIAS2"/>
      <pin position="E1" pad="GNDIN"/>
      <pin position="E2" pad="PA"/>
      <pin position="E3" pad="PB02"/>
      <pin position="E4" pad="RESET_N"/>
      <pin position="E5" pad="PB13"/>
      <pin position="E6" pad="PB09"/>
      <pin position="E7" pad="PA15"/>
      <pin position="E8" pad="GNDIO00"/>
      <pin position="F1" pad="VDDCORE"/>
      <pin position="F2" pad="TCK"/>
      <pin position="F3" pad="PA"/>
      <pin position="F4" pad="PB"/>
      <pin position="F5" pad="PA"/>
      <pin position="F6" pad="PB10"/>
      <pin position="F7" pad="PA16"/>
      <pin position="F8" pad="VPUMP"/>
      <pin position="G1" pad="GNDIO04"/>
      <pin position="G2" pad="PA26"/>
      <pin position="G3" pad="PA"/>
      <pin position="G4" pad="PA00"/>
      <pin position="G5" pad="PA01"/>
      <pin position="G6" pad="PA19"/>
      <pin position="G7" pad="PA18"/>
      <pin position="G8" pad="PA17"/>
      <pin position="H1" pad="VDDIO04"/>
      <pin position="H2" pad="PA25"/>
      <pin position="H3" pad="PA"/>
      <pin position="H4" pad="PB"/>
      <pin position="H5" pad="PA"/>
      <pin position="H6" pad="VDDIO"/>
      <pin position="H7" pad="PA20"/>
      <pin position="H8" pad="PB11"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>